In [4]:
"""1:02:00 / 1:05:23"""
"""pip install openpyxl"""
import pandas as pd

In [18]:
df = pd.read_excel("data.xlsx")
df

   Unnamed: 0  S2 Train No.  S2 Speed  S2 City
0           0         12322       150   Rampur
1           1         12534       123  Kolkata
2           2        125654        67  Bareily
3           3        564523        87    Delhi

In [7]:
df2 = pd.read_excel("data.xlsx", sheet_name="Sheet2")
df2

   S2 Train No.  S2 Speed  S2 City
0         12322        50   Rampur
1         12534       123  Kolkata
2        125654        67  Bareily
3        564523        87    Delhi

In [17]:
df2.iloc[0, 1] = 150
df2.to_excel("data.xlsx", sheet_name="Sheet2")